temp1/src/Catalogs/Проекты/Проекты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Проекты</name>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <predefined>
    <items>
      <name>ОсновнойПроект</name>
      <description>Основной проект</description>
    </items>
  </predefined>
  <attributes>
    <name>Актуален</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаДоступа</name>
    <type>
      <types>CatalogRef.ГруппыДоступаПроекты</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойЗаказчик</name>
    <type>
      <types>CatalogRef.Заказчики</types>
    </type>
  </attributes>
  <attributes>
    <name>Цвет</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновноеКонтактноеЛицо</name>
    <type>
      <types>CatalogRef.КонтактныеЛицаЗаказчиков</types>
    </type>
  </attributes>
  <attributes>
    <name>МинимальныйПриоритет</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Теги</name>
    <attributes>
      <name>Тег</name>
      <type>
        <types>CatalogRef.Теги</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <comment>Свойство</comment>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <comment>Значение</comment>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

temp1/src/Catalogs/Проекты/ManagerModule.bsl
Функция ПолучитьОсновнойПроектЗаказчика(Заказчик) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Проекты.Ссылка КАК Проект
	               |ИЗ
	               |	Справочник.Проекты КАК Проекты
	               |ГДЕ
	               |	НЕ Проекты.ПометкаУдаления
	               |	И Проекты.ОсновнойЗаказчик = &Заказчик
	               |	И Проекты.Актуален";
	Запрос.УстановитьПараметр("Заказчик",Заказчик);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Количество() = 1 Тогда
		Выборка.Следующий();
		Возврат Выборка.Проект;
	КонецЕсли;
	Возврат Справочники.Проекты.ПустаяСсылка();
КонецФункции

Функция ПроектЗаказчикаПоНаименованию(Наименование, Заказчик) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Проекты.Ссылка КАК Проект
	               |ИЗ
	               |	Справочник.Проекты КАК Проекты
	               |ГДЕ
	               |	НЕ Проекты.ПометкаУдаления
	               |	И Проекты.Наименование = &Наименование
	               |	И Проекты.ОсновнойЗаказчик = &Заказчик
	               |	И Проекты.Актуален";
	Запрос.УстановитьПараметр("Наименование",Наименование);
	Запрос.УстановитьПараметр("Заказчик",Заказчик);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Количество() = 1 Тогда
		Выборка.Следующий();
		Возврат Выборка.Проект;
	КонецЕсли;
	Возврат Справочники.Проекты.ПустаяСсылка();
КонецФункции
